* Add a moons table
:PROPERTIES:
:header-args: sql :engine postgresql :dbuser nico :database extrasolar
:END:
** Someday in the future, technology will allow us to start observing the moons of extrasolar planets. At that point, we're going to need a moons table in our extrasolar database. For this exercise, your task is to add that table to the database. The table should include the following data:

id: a unique serial number that auto-increments and serves as a primary key for this table.
designation: the designation of the moon. We will assume that moon designations will be numbers, with the first moon discovered for each planet being moon 1, the second moon being moon 2, etc. The designation is required.
semi_major_axis: the average distance in kilometers from the planet when a moon is farthest from its corresponding planet. This field must be a number greater than 0, but is not required; it may take some time before we are able to measure moon-to-planet distances in extrasolar systems.
mass: the mass of the moon measured in terms of Earth Moon masses. This field must be a numeric value greater than 0, but is not required.
Make sure you also specify any foreign keys necessary to tie each moon to other rows in the database.

#+BEGIN_SRC sql
  CREATE TABLE moons(
    id serial PRIMARY KEY,
    designation int NOT NULL,
    semi_major_axis NUMERIC CHECK(semi_major_axis > 0),
  mass NUMERIC CHECK(mass > 0));
#+END_SRC

#+RESULTS:
| CREATE TABLE |
|--------------|
** add foreign key to relate planets

#+BEGIN_SRC sql
  ALTER TABLE moons
    ADD COLUMN planet_id int REFERENCES planets(id);
#+END_SRC

#+RESULTS:
| ALTER TABLE |
|-------------|
